#include<stdio.h>

void fun()
{
    int x,y;
    scanf("%d%d",&x,&y);
    int mult = x*y;
    printf("%d\n",mult);
}
int main()
{
    /*
        ফাংশন ডিক্লেয়ার করার সময় প্যারামিটার রাখার জায়গাতে void লিখে আমরা যদি
        মেইন ফাংশন থেকে ফাংশন টাকে কল করার সময় জোর করে প্যারামিটার পাস করার 
        চেষ্টা করি তাহলে নিশ্চিত error খাবো। ব্যাপার টা এমন যে - বেটা লিখতেছে void 
        আবার প্যারামিটার ও দ্যায়। ফাজিল কোথাকার। 
        
        আর যদি আমরা ফাংশন ডিক্লেয়ার করার সময় প্যারামিটার রাখার জায়গাটা খালি রাখি 
        তার অর্থ হচ্ছে প্যারামিটার নিবে না এবং আমরা যদি এখন মেইন ফাংশন থেকে 
        ফাংশন টাকে কল করার সময় প্যারামিটার পাস করার চেষ্টা করি তাহলে কোনো সমস্যা 
        হবে না। কারণ ফাংশন্টা তখন ওই প্যারামিটারগুলোকে ইগনোর করবে। 
    */
    
    fun();
    
    return 0;
}