#include<stdio.h>
#include<string.h>

int main()
{
    char a[100],b[100];
    scanf("%s%s",a,b);

    // strcmp() সবসময় একটা ভ্যালু রিটার্ন করে।
    // zero, 1, -1, এখানে একটা কথা মনে রাখতে হবে- সবসময় যে 1 বা -1 ই রিটার্ন করবে 
    // এটা guaranteed না। এক্ষেত্রে zero এর চাইতে বড় ভ্যালু বা zero এর চেয়ে ছোট কোন ভ্যালু রিটার্ন করতে হবে।   
    /*
        ১। যদি zero রিটার্ন করে তার মানে হলো দুইটা স্ট্রিং ই সমান
        ২। যদি zero এর চাইতে বড় কোন ভ্যালু রিটার্ন করে তার মানে হলো ডানপাশের স্ট্রিং টা ছোট
        ৩। যদি zero এর চাইতে ছোট কোন ভ্যালু রিটার্ন করে তার মানে হলো বামপাশের স্ট্রিং টা ছোট
    */
    int val = strcmp(a,b);

    if(val<0)
    {
        printf("A is smaller\n");
    }
    else if(val>0)
    {
        printf("B is smaller\n");
    }
    else // ছোট ও না আবার বড় ও না। তার মানে সমান
    {
        printf("Same\n");
    }
    
    return 0;
}